[
    {
        "word": "coincidence",
        "meaning": "tesadüf",
        "sentence": "She believes in fate, and says there are no coincidences or luck; everything happens for a reason."
    },
    {
        "word": "agility",
        "meaning": "çeviklik, beceriklilik, beceri",
        "sentence": "Healthful exercise of the body should be repeated for purposes of strength and agility."
    },
    {
        "word": "yell",
        "meaning": "bağırmak, seslenmek, feryat, çığlık, bağırma",
        "sentence": "The boys were yelling and running around late last night, so they woke the neigbors."
    },
    {
        "word": "yield",
        "meaning": "ürün vermek, sağlamak, teslim olmak, verim, getiri, kazanç",
        "sentence": "The Cuban government has refused to yield to pressure from the US to end communist rule."
    },
    {
        "word": "attitude",
        "meaning": "tutum, düşünce, fikir",
        "sentence": "You have a very bad attitude, and if it's doesn't change, you'll be fired."
    },
    {
        "word": "reckless",
        "meaning": "umursamaz",
        "sentence": "She has a reckless attitude towards relationship, which has made it difficult for her stay with one man for very long."
    },
    {
        "word": "masterpiece",
        "meaning": "şahaser",
        "sentence": "Marchenko aims to reflect the energy of war with her unique masterpiece."
    },
    {
        "word": "mastermind",
        "meaning": "ustaca planlamak, çekip çevirmek, bir işin beyni, deha",
        "sentence": "Osama bin Laden wwas the masterming behind the terrorist attack on the World Trade Center."
    },
    {
        "word": "embarrass",
        "meaning": "utandırmak, eli darda olmak",
        "sentence": "The boy embarrassed his mother when he told his friends that she had gotten drunk and throw up at a party the night before."
    },
    {
        "word": "remarkable",
        "meaning": "kayda değer, önemli hatırı sayılır",
        "sentence": "Jane wrote a remarkable book about her journey accross the Austrian desert by camel."
    },
    {
        "word": "precede",
        "meaning": "-den önce gelmek, -den üstün olmak",
        "sentence": "Wilfred observed that big thinking precedes great achievements."
    },
    {
        "word": "impression",
        "meaning": "izlenim, intiba, kanı, taklit",
        "sentence": "Don't close your eyes during the lecture, you don't want to create the impression that you're bored."
    },
    {
        "word": "instinct",
        "meaning": "içgüdü, sezgi, kabiliyet",
        "sentence": "Many animals seem to have an instict that tells them when an earthquake is going to occur."
    },
    {
        "word": "endure",
        "meaning": "tahammül etmek, katlanmak",
        "sentence": "Students have to endure a lot of pressure during exam time."
    },
    {
        "word": "obscure",
        "meaning": "anlaşılmaz, belirsiz",
        "sentence": "His theories are based on the writings of some obscure philosopher of the 1700s."
    },
    {
        "word": "enslave",
        "meaning": "köleleştirmek, esaret, kölelik",
        "sentence": "A group of Martians are planning to invade Earth, and enslave all humans."
    },
    {
        "word": "internal",
        "meaning": "dahili, içsel, içe ait",
        "sentence": "The police are taking action to strengthen internal security after the attack on the President."
    },
    {
        "word": "illegible",
        "meaning": "okunaksız",
        "sentence": "The apprentices could decipher the very illegible handwriting in which the physicians wrote their prescriptions."
    },
    {
        "word": "designated",
        "meaning": "belirtilen, belirlenmiş, atanmış",
        "sentence": "Medical examinations are compulsary for foreign students from designated countries in order to receive a visa."
    },
    {
        "word": "deteriorate",
        "meaning": "fenalaşmak, kötüye gitmek",
        "sentence": "She's worried her English language skills will deteriorate once she returns to her homeland."
    },
    {
        "word": "mild",
        "meaning": "yumuşak, hafif",
        "sentence": "This soap is very mild, and can be used on the face, and even on babies."
    },
    {
        "word": "harsh",
        "meaning": "sert, haşin",
        "sentence": "The harsh criticism of the play in the newspaper really upset the actors."
    },
    {
        "word": "endeavour",
        "meaning": "çabalamak",
        "sentence": "Investigators are endeavoring to find the main cause of the crash."
    },
    {
        "word": "foster",
        "meaning": "büyütmek, teşvik etmek",
        "sentence": "The old couple fostered over 50 children over the years, and still keep in contact with most of them."
    },
    {
        "word": "insist",
        "meaning": "ısrar etmek",
        "sentence": "My wife insists on eating only organic fruits and vegetables."
    },
    {
        "word": "drainage",
        "meaning": "boşaltım, gider",
        "sentence": "The drainage system is getting old, and is no longer sufficient to carry the large amount of water."
    },
    {
        "word": "contradict",
        "meaning": "çelişmek, yadsımak, karşı çıkmak",
        "sentence": "The results of his new experiment seem to contradict the findings of earlier studies."
    }
]